posts/signed-char-and-unsigned-char/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>char类型的符号特性 | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link href="/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://blog.wangzhl.com/posts/signed-char-and-unsigned-char/">
<link rel="icon" href="/favicon.ico" sizes="64x64">
<link rel="prev" href="/posts/list-shared-memory-in-system/" title="查看操作系统中所有的共享内存" type="text/html">
<link rel="next" href="/posts/cpp-access-container-by-iterator-or-position/" title="使用迭代器和下标访问C++容器的比较" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="char类型的符号特性">
<meta property="og:url" content="https://blog.wangzhl.com/posts/signed-char-and-unsigned-char/">
<meta property="og:description" content="在C++中 char 类型用来表示字符，其数据宽度为一个字节，通常也可以将 char 用作占一个字节的整数。但整数类型又分为无符号整数和有符号整数，对于具有相同数据宽度的有符号整数和无符号整数，它们的允许的取值范围是不同的。在将 char 当作整型数据使用时，要格外注意其符号特性。





char 类型的符号特性


最近在移植一个数据压缩算法时遇到这样的问题：原始代码是在x86架构的Wind">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-09-28T22:45:18+08:00">
<meta property="article:tag" content="char">
<meta property="article:tag" content="cpp">
<meta property="article:tag" content="signed">
<meta property="article:tag" content="unsigned">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/">Home</a>
            <a class="page-link" href="/archive/">Archive</a>
            <a class="page-link" href="/tags/">Tags</a>
            <a class="page-link" href="/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">char类型的符号特性</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2020-09-28T22:45:18+08:00" itemprop="datePublished">Sep 28, 2020</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <p>
在C++中 <code>char</code> 类型用来表示字符，其数据宽度为一个字节，通常也可以将 <code>char</code> 用作占一个字节的整数。但整数类型又分为无符号整数和有符号整数，对于具有相同数据宽度的有符号整数和无符号整数，它们的允许的取值范围是不同的。在将 <code>char</code> 当作整型数据使用时，要格外注意其符号特性。<br></p>

<!-- TEASER_END -->

<div id="outline-container-orgb096d78" class="outline-2">
<h2 id="orgb096d78">
<code>char</code> 类型的符号特性</h2>
<div class="outline-text-2" id="text-orgb096d78">
<p>
最近在移植一个数据压缩算法时遇到这样的问题：原始代码是在x86架构的Windows操作系统上运行的，移植目标是ARM架构的Linux操作系统，在移植后发现某个解压缩算法的处理结果不正确。<br></p>

<p>
经过一番调试，最终将问题定位在 <code>char</code> 类型的符号特性上。原算法在Windows系统的MSVC编译环境中使用了 <code>char</code> 作为单字节有符号整数，而在ARM架构的Linux系统上使用gcc编译时 <code>char</code> 却是无符号的。<br></p>

<blockquote>
<p>
<code>char</code> 类型的符号特性在不同的编译器下是不同的。<br></p>
</blockquote>

<p>
曾经我也想当然地认为char是有符号的，即像整型变量一样 <code>signed</code> 关键字是被省略掉了。但实际上，在C++标准中， <code>char</code> 类型是作为字符类型与整数类型分开描述的。<br></p>

<blockquote>
<p>
The type <code>char</code> , <code>signed char</code> and <code>unsigned char</code> are collectively called the character types. The implementation shall define <code>char</code> to have the same range, representation, and behavior as either <code>signed char</code> or <code>unsigned char</code> .<br></p>

<p>
<code>CHAR_MIN</code> , defined in <code>&lt;limits.h&gt;</code> , will have one of the values 0 or <code>SCHAR_MIN</code> , and this can be used to distinguish the two options. Irrespective of the choice made, <code>char</code> is separate type from the other two and is not compatible with either.<br></p>
</blockquote>

<p>
以上摘自C11标准（n1587），可见标准中并未规定 <code>char</code> 类型的符号特性，即 <code>char</code> 可以是 <code>signed</code> 或 <code>unsigned</code> ，并由具体的实现（implementation）决定。某些处理器和指令集或应用程序二进制接口更喜欢使用有符号的字符类型，这样能够完美地映射一些机器码指令，反之亦然。<br></p>
</div>
</div>


<div id="outline-container-org9d1ebf1" class="outline-2">
<h2 id="org9d1ebf1">使用 <code>uint8_t</code> 表示单字节无符号整数</h2>
<div class="outline-text-2" id="text-org9d1ebf1">
<p>
通常，当我们把 <code>char</code> 作为字符类型使用时并不需要考虑它的符号特性，因为字符类型变量存储的ASCII码在显示时会转化为英文字母。这时， <code>char</code> 是有符号的或无符号的并不影响它所存储的ASCII码。<br></p>

<p>
由于 <code>char</code> 类型只占一个字节（8bit），并且又是基本类型，用它来表示单字节整数是非常方便的。但是，不确定的符号特性又使它不适合作为一种整数类型。更推荐使用 <code>uint8_t</code> 表示无符号单字节整数， <code>int8_t</code> 表示有符号单字节整数，这种写法代码可读性更好，也更利于移植。<br></p>
</div>
</div>


<div id="outline-container-org507e7c9" class="outline-2">
<h2 id="org507e7c9">相关的编译器选项</h2>
<div class="outline-text-2" id="text-org507e7c9">
<p>
gcc 提供了 <code>-fsigned-char</code> 和 <code>-funsigned-char</code> 编译选项，用于指定 <code>char</code> 类型的默认符号特性。但是大多数情况下并不推荐使用使用这两个参数。因为修改后可能在极端情况下破坏调用约定（call conversion）和应用程序二进制接口（ABI, application binary interface）。<br></p>

<p>
msvc 提供了 <code>/J</code> 参数，用于将默认的 <code>char</code> 类型从 <code>signed char</code> 变更为 <code>unsigned char</code> ，并在 <code>char</code> 拓展到更宽数据类型时（如 <code>int</code> ），使用无符号整数的拓展方式。如果在ATL/MFC工程中使用了这个参数，开发环境可能会报错；尽管可以通过定义 <code>_ATL_ALLOW_CHAR_UNSIGNED</code> 禁用这个错误，但这样做可能并不奏效。<br></p>

<p>
综上，尽管编译器都提供了参数用于更改默认的 <code>char</code> 类型的符号特性，但它们都会在某些情况下失效。所以，如果真的需要单字节的整型变量，还是明确地声明为 <code>signed char</code> 或 <code>unsigned char</code> 吧，或者使用标准库提供的 <code>int8_t</code> 或 <code>uint8_t</code> 。<br></p>
</div>
</div>


<div id="outline-container-org29258f3" class="outline-2">
<h2 id="org29258f3">参考资料</h2>
<div class="outline-text-2" id="text-org29258f3">
<ul class="org-ul">
<li>
<a href="https://stackoverflow.com/questions/46463064/what-causes-a-char-to-be-signed-or-unsigned-when-using-gcc">stackoverflow - char signed or unsigned</a><br>
</li>
<li>
<a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1570.pdf">open std - n1570</a><br>
</li>
<li>
<a href="https://docs.microsoft.com/en-us/cpp/build/reference/j-default-char-type-is-unsigned">microsoft docs - default char type is unsigned</a><br>
</li>
</ul>
<p>
（全文完）<br></p>
</div>
</div>
  </div>
  
  <ul class="tags-list vertical-center">
<li>
      <a class="badge" href="/tags/char/" rel="tag">char</a>
    </li>
    <li>
      <a class="badge" href="/tags/cpp/" rel="tag">cpp</a>
    </li>
    <li>
      <a class="badge" href="/tags/signed/" rel="tag">signed</a>
    </li>
    <li>
      <a class="badge" href="/tags/unsigned/" rel="tag">unsigned</a>
    </li>
  </ul></article><ul class="post-pager hidden-print">
<li class="previous">
      <a href="/posts/list-shared-memory-in-system/" rel="prev">Previous post
        <br><span>查看操作系统中所有的共享内存</span>
      </a>
    </li>
    <li class="next">
      <a href="/posts/cpp-access-container-by-iterator-or-position/" rel="next">Next post
        <br><span>使用迭代器和下标访问C++容器的比较</span>
      </a>
    </li>
  </ul>
<section class="comments hidden-print"><div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="samsonwang-blog",
            disqus_url="https://blog.wangzhl.com/posts/signed-char-and-unsigned-char/",
        disqus_title="char\u7c7b\u578b\u7684\u7b26\u53f7\u7279\u6027",
        disqus_identifier="_cache/archives/2020/signed-char-and-unsigned-char.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


  </section><script>var disqus_shortname="samsonwang-blog";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
  </main><footer class="site-footer h-card"><div class="wrapper">
      <div class="footer-col-wrapper">

        <div class="footer-col">
          <p class="site-desc">Personal handnote on software development</p>
        </div>

        <div class="footer-col">
          <div class="p-name">Samson Wang</div>
          <div class="copyright">Copyright 2021, all rights reserved.</div>
          <div class="social-links">
            <ul class="social-media-list">
<li><a rel="me" href="/rss.xml">
                <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#rss"></use></svg></a></li>
              <li><a rel="nofollow" href="https://github.com/samsonwang">
                <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#github"></use></svg></a></li>
              <li><a rel="nofollow" href="https://twitter.com/samsonwangcn">
                <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#twitter"></use></svg></a></li>
              <li><a rel="nofollow" href="https://facebook.com/samsonwangcn">
                 <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#facebook"></use></svg></a></li>
            </ul>
</div>

        </div>

      </div>

    </div>

  </footer><div id="scroll-top" title="back to top">
  <div id="scroll-top-arrow"></div>
  <div id="scroll-top-stick"></div>
</div>


      <script src="/assets/js/lazyload.min.js"></script><script src="/assets/js/minima.min.js"></script><!-- google adsense --><script data-ad-client="ca-pub-6303134192857919" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><!-- Google Analytics - Global site tag (gtag.js) --><script async src="https://www.googletagmanager.com/gtag/js?id=UA-108507797-1"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());
  gtag('config', 'UA-108507797-1');
</script><!-- baidu tongji --><script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "https://hm.baidu.com/hm.js?1dcffb5494ab56e69005c957d7320ad1";
  var s = document.getElementsByTagName("script")[0];
  s.parentNode.insertBefore(hm, s);
})();
</script>
</body>
</html>
